import numpy as np

첫번째밭 = [
    [1, 0, 0, 0, 0],
    [0, 0, 1, 0, 1],
    [0, 0, 1, 0, 1],
    [0, 0, 1, 0, 1],
    [0, 0, 1, 0, 1],
]

두번째밭 = [
    [0, 0, 0, 0, 1],
    [0, 0, 0, 0, 3],
    [0, 0, 0, 0, 4],
    [0, 2, 0, 0, 2],
    [4, 5, 0, 2, 0],
]

# 풀이 1
정답 = np.rot90(두번째밭, 1) + np.array(첫번째밭)

for k in range(5):
    print(chr(int("".join([str(i) for i in 정답[k]]), 8)))


# 풀이 2
# 0, 4 -> 0, 0    0, 3 -> 1, 0    0, 2 -> 2, 0
# 1, 4 -> 0, 1    1, 3 -> 1, 1    1, 2 -> 2, 1
# 2, 4 -> 0, 2    2, 3 -> 1, 2    2, 2 -> 2, 2     ...
# 3, 4 -> 0, 3    3, 3 -> 1, 3    3, 2 -> 2, 3
# 4, 4 -> 0, 4    4, 3 -> 1, 4    4, 2 -> 2, 4

sample = [
    [0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0],
]

for i in range(len(두번째밭)):
    for j in range(len(두번째밭[0])):
        sample[i][j] = 두번째밭[j][len(두번째밭) - 1 - i]

for i in range(len(두번째밭)):
    for j in range(len(두번째밭[0])):
        sample[i][j] += 첫번째밭[i][j]
